turbulence_models/SA_Detailed/Check/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
20540
(
(48.9999 1.73196e-08 0)
(48.9995 7.69707e-08 0)
(48.9999 3.8915e-08 0)
(48.9995 1.61883e-07 0)
(48.9999 4.87747e-08 0)
(48.9995 1.78987e-07 0)
(48.9999 6.01668e-08 0)
(48.9995 2.00015e-07 0)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (49 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    lowerWallStartup
    {
        type            symmetryPlane;
    }
    upperWallStartup
    {
        type            symmetryPlane;
    }
    upperWall
    {
        type            noSlip;
    }
    lowerWall
    {
        type            noSlip;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
